export enum UserRole {
  User = "user",
  Admin = "admin",
  Recruiter = "recruiter",
}

export enum JobStatus {
  Draft = "draft",
  Posted = "posted",
  Closed = "closed",
}

export const JOB_EMPLOYMENT_TYPES = [
  "Ээлжийн",
  "Улирлаар",
  "Бүтэн цагийн",
  "Хагас цагийн",
  "Цагийн",
  "Гэрээт",
  "Түр ажил",
] as const;

export const JOB_LEVELS = [
  "Ажилтан",
  "Мэргэжилтэн",
  "Дадлагажигч / Оюутан",
  "Менежер",
  "Ахлах ажилтан",
  "Нэгжийн дарга",
  "Гүйцэтгэх удирдлага",
] as const;

export const DEPARTMENT = [
  "Автомашин, авто засвар үйлчилгээ",
  "Аялал жуулчлал, зочид буудал",
  "Банк, санхүү, нягтлан бодох бүртгэл",
  "Барилга, үл хөдлөх хөрөнгө",
  "Биеийн тамир, спорт, гоо сайхан",
  "Боловсрол, шинжлэх ухаан",
  "Даатгал",
  "Захиргаа, хүний нөөц",
  "Маркетинг PR, менежмент",
  "Мэдээллийн технологи, программ хангамж",
  "Ресторан, хоол үйлдвэрлэл",
  "Соёл урлаг, энтертайнмент",
  "Төрийн болон төрийн бус байгууллага, ОУБ",
  "Тээвэр логистик, авто зам, агуулах",
  "Уул уурхай",
  "Үйлдвэрлэл, инженерчлэл",
  "Харилцаа холбоо, шуудан",
  "Хөдөө аж ахуй, байгаль орчин",
  "Худалдаа, борлуулалт",
  "Хууль хүчний байгууллага, харуул хамгаалалт",
  "Хууль, эрх зүй",
  "Хэвлэл мэдээлэл, сэтгүүл зүй, дизайн",
  "Энгийн ажил мэргэжил, үйлчилгээ",
  "Эрүүл мэнд",
  "Эрчим хүч, дулаан хангамж",
];

export type JobEmploymentType = (typeof JOB_EMPLOYMENT_TYPES)[number];
export type JobLevel = (typeof JOB_LEVELS)[number];
export type Department = (typeof DEPARTMENT)[number];
